#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.produto_credito_eventbridge_rodolfo: Refreshing state... [id=produto_credito_eventbridge_rodolfo]
aws_cloudwatch_log_group.log_state_machine_produto_credito: Refreshing state... [id=log_state_machine_produto_credito_rodolfo]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=850202893763]
aws_sfn_state_machine.produto_credito_state_machine_rodolfo: Refreshing state... [id=arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine_rodolfo]
aws_cloudwatch_event_target.target_produto_credito_rodolfo: Refreshing state... [id=produto_credito_eventbridge_rodolfo-terraform-20240327130535555200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.target_produto_credito_rodolfo will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "target_produto_credito_rodolfo" {
      ~ arn            = "arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine_rodolfo" -> (known after apply)
        id             = "produto_credito_eventbridge_rodolfo-terraform-20240327130535555200000001"
        # (4 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.produto_credito_state_machine_rodolfo must be replaced
-/+ resource "aws_sfn_state_machine" "produto_credito_state_machine_rodolfo" {
      ~ arn                       = "arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine_rodolfo" -> (known after apply)
      ~ creation_date             = "2024-03-27T12:52:09Z" -> (known after apply)
      + description               = (known after apply)
      ~ id                        = "arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine_rodolfo" -> (known after apply)
      ~ name                      = "produto_credito_state_machine_rodolfo" -> "produto_credito_state_machine_rodolfo_teste_alteracao" # forces replacement
      + name_prefix               = (known after apply)
      + revision_id               = (known after apply)
      + state_machine_version_arn = (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "DMA" = "DataMeshAcademy"
        }
      + version_description       = (known after apply)
        # (5 unchanged attributes hidden)

      ~ tracing_configuration {
          ~ enabled = false -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rodolfoarmelim, Action: `pull_request`*